[
    {
        "image": "/assets/images/employeeDirectory.gif",
        "title": "Employee Directory",
        "technologies": "React, Bootstrap",
        "description": "This Employee Directory presents a list of employees with their profile picture, name, phone number, email, and birthday. The columns can be sorted ascending or descending. The employee list can be narrowed using the search bar to search by first name or last name.",
        "responsibility": "I have created this application from scratch using React. The list of employees for this example was created through an API call to the Random User Generator website through Axios.",
        "livePage": "https://mimila-85.github.io/employee-directory/",
        "gitHub": "https://github.com/Mimila-85/employee-directory"
    },
    {
        "image": "/assets/images/crushIt.gif",
        "title": "Crush it!",
        "technologies": "Express.js, MongoDB, Mongoose, ESLint, Handlebars, CSS, jQuery, Bootstrap",
        "description": "Crush It! is a personal workout tracking application that allows the user to set up an account, create a workout routine by selecting from a range of exercises, update a routine, and track its progress compared to previous sessions.",
        "responsibility": "This was a group project, where my main responsibility was setting up the back-end models, controllers, seeds, and server; however, I also helped with the views and front-end JavaScript.",
        "livePage": "https://youcrushit.herokuapp.com/",
        "gitHub": "https://github.com/Mimila-85/you-crush-it"
    },
    {
        "image": "/assets/images/employeeSummaryTemplate.gif",
        "title": "Employee Summary Template",
        "technologies": "Node.js, MySQL, Inquirer",
        "description": "This application helps you to quickly create a website with your team profile information.",
        "responsibility": "My responsibility on this project was to write the employees classes that would pass the tests provided by the quality assurance documentation. As well as the main app.js file with the user interface module Inquirer.js. Using the module fs a team.html file is written with the team contact information.",
        "livePage": "https://youtu.be/pyuKPdjc-wk",
        "gitHub": "https://github.com/Mimila-85/TemplateEngine_EmployeeSummary"
    },
    {
        "image": "/assets/images/readMeDemo.gif",
        "title": "ReadMe Generator",
        "technologies": "Node.js, Inquirer",
        "description": "This application helps you to save time with your README documentation leaving you with more time to focus on your project.",
        "responsibility": "It uses Node.js to run prompts in the command line using the user interface provided by Inquirer.js. A professional README is built using the user response, through Node.js standard library package fs a new md file is created. Same principle can be used to build and write different types of files as an entire html web application.",
        "livePage": "https://youtu.be/a96_-C-wxhA",
        "gitHub": "https://github.com/Mimila-85/README-Generator"
    },
    {
        "image": "/assets/images/nationalParks.gif",
        "title": "National Parks",
        "technologies": "HTML, CSS, JavaScript, APIs, Materialize, GoogleFonts",
        "description": "This application allows the user to search for National Parks by state.",
        "responsibility": "This was a group project where originally I was responsible only for the javaScript and API portion; however, I have redesigned the CSS style sheet to improve its looks.",
        "livePage": "https://mimila-85.github.io/National-Park/",
        "gitHub": "https://github.com/Mimila-85/National-Park"
    },
    {
        "image": "/assets/images/weatherDashboard.gif",
        "title": "Weather Dashboard",
        "technologies": "HTML, CSS, JavaScript, APIs, Bootstrap",
        "description": "This application allows the user to search by city name to find out the current weather and the five-day forecast for that city.",
        "responsibility": "I have designed it from scratch creating a html, css, javaScript, and it uses API’s to collect the weather information.",
        "livePage": "https://mimila-85.github.io/Weather-Dashboard/",
        "gitHub": "https://github.com/Mimila-85/Weather-Dashboard"
    }
]